Autodesk.Revit.DB.LinkNode.GetDocument
Returns the document associated with the link.
Remarks:
The document is in read-only state. Transactions are not allowed in it.
Returns:
Instance of a Document
Since:
2014

Autodesk.Revit.DB.LinkNode
An output node that represents a linked Revit document.
Remarks:
See also: Autodesk::Revit::DB::IExportContext::OnLinkBegin.
Since:
2014